# ExportFontKey Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontKey Class
Members See Also
---
A key used to represent an item stored in an ExportFontTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportFontKey : IDisposable
```

Visual Basic
---
```text
Public Class ExportFontKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportFontKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportFontKey
# See Also
ExportFontKey Members
Autodesk.Revit.DB Namespace